## Bài kiểm tra số 2 - Ca 2

## Phần 1: Numpy

In [1]:
# 1. Tạo một mảng numpy 1 chiều even_numbers chứa 10 phần tử là các số chẵn trong phạm vi [2,20] 
import numpy as np
even_numbers = np.arange(2,21,2)
even_numbers

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [2]:
# 2. Tạo một mảng numpy 1 chiều chứa 5 phần tử là các số chia cho 5 dư 1 (số nguyên có dạng 5x + 1) trong phạm vi [1,21].
arr1 = np.arange(1, 22)  
arr1 = arr1[arr1 % 5 == 1] 
arr1

array([ 1,  6, 11, 16, 21])

In [11]:
# 3.Tạo 1 mảng 1 chiều gồm 11 phần tử cách đều nhau từ 0 đến 1
arr2 = np.linspace(0, 1, 11) 
arr2
# Cho biết khoảng cách giữa các giá trị retstep

array([0. , 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1. ])

In [10]:
# 4.Tạo mảng numpy 1 chiều chứa 10 phần tử với các phần tử ở index chẵn là 0 và ở index lẻ là số lẻ
import numpy as np
arr3 = np.zeros(10, dtype=int)
for i in range(1, 10, 2):
    arr3[i] = i
arr3

array([0, 1, 0, 3, 0, 5, 0, 7, 0, 9])

In [8]:
# 5.Tạo 1 mảng 1 chiều gồm 10 phần tử có các phần tử ở index [0,3,6,9] là 3 và các phần tử còn lại là 1 
arr4 = np.ones(10, dtype=int)
arr4[[0, 3, 6, 9]] = 3
arr4

array([3, 1, 1, 3, 1, 1, 3, 1, 1, 3])

In [9]:
# 6. Tạo một mảng numpy 2 chiều arr_2d (6x6) với các phần tử ngẫu nhiên trong khoảng từ 1 đến 100. 
np.random.seed(1)
arr_2D = np.random.randint(1, 101, size=(6, 6))
arr_2D

array([[38, 13, 73, 10, 76,  6],
       [80, 65, 17,  2, 77, 72],
       [ 7, 26, 51, 21, 19, 85],
       [12, 29, 30, 15, 51, 69],
       [88, 88, 95, 97, 87, 14],
       [10,  8, 64, 62, 23, 58]], dtype=int32)

In [ ]:
# 7. Tạo mảng temp là mảng arr_2d đã xóa các dòng mà giá trị cột cuối là lẻ

In [ ]:
# 8. Thêm cột 7 là tổng của mỗi dòng trong arr_2d

In [ ]:
# 9. Thêm dòng thứ 7 là tổng của mỗi cột trong arr_2d

In [ ]:
# 10. Sửa các giá trị nhỏ hơn 30 và chia hết cho 2 tại dòng đầu tiên trong arr_2d thành 30

## Phần 2: Pandas

In [1]:
import pandas as pd

In [2]:
#1. Đọc dữ liệu từ tập tin train.csv và lưu vào biến titanic.

titanic = pd.DataFrame(pd.read_csv('tips.csv',index_col=0,sep=','))
titanic

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [8]:
#2. Cho biết dữ liệu ghi lại thông tin của các ngày nào trong tuần.
titanic['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [9]:
#3. Cho biết số khách hàng nam và nữ.
titanic['sex'].value_counts().reset_index()

      sex  count
0    Male    157
1  Female     87

In [12]:
#4. Cho biết giá(total_bill) trung bình của mỗi ngày (day)
titanic.groupby('day')['total_bill'].mean().reset_index()

    day  total_bill
0   Fri   17.151579
1   Sat   20.441379
2   Sun   21.410000
3  Thur   17.682742

In [11]:
#5. Cho biết tiền tip (tip) trung bình của khách hàng nam và nữ khi đi ăn.
titanic.groupby('sex')['tip'].mean().reset_index()

      sex       tip
0  Female  2.833448
1    Male  3.089618

In [13]:
#6. Cho biết số khách hàng đi ăn và mỗi ngày trong tuần.
titanic.groupby('day')['size'].sum().reset_index()

    day  size
0   Fri    40
1   Sat   219
2   Sun   216
3  Thur   152

In [14]:
#7. Cho biết buổi nào(time) có nhiều khách hàng đi ăn hơn.
titanic.groupby('time')['size'].max().reset_index()

     time  size
0  Dinner     6
1   Lunch     6

In [20]:
#8. Cho biết 25% giá bill cao nhất ở mức bao nhiêu 
titanic.loc[titanic['total_bill'] > titanic['total_bill'].quantile(0.75),'total_bill'].max()

np.float64(50.81)

In [21]:
#9. Thống kê tổng số hành khách trong mỗi buổi
titanic.groupby('time')['size'].sum().reset_index()

     time  size
0  Dinner   463
1   Lunch   164

In [27]:
#10. Cho biết trung bình bill vào 2 ngày cuối tuần.
titanic[(titanic['day'] == 'Sat') |(titanic['day'] == 'Sun')].groupby('day')['total_bill'].mean().reset_index()

   day  total_bill
0  Sat   20.441379
1  Sun   21.410000